spec/cassettes/Create_a_payment_with_a_successful_charge/creates_the_payment_with_the_amount.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_1BN0r3ACRY9yqAzK4VaA68Bg
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.7.0
      Authorization:
      - Bearer sk_test_mOcn0ESCsNyhdadkVcd8vFoU
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.7.0","lang":"ruby","lang_version":"2.2.8 p477 (2017-09-14)","platform":"x86_64-darwin17","engine":"ruby","publisher":"stripe","uname":"Darwin
        DAVIDs-MacBook-Air.local 17.0.0 Darwin Kernel Version 17.0.0: Thu Aug 24 21:48:19
        PDT 2017; root:xnu-4570.1.46~2/RELEASE_X86_64 x86_64","hostname":"DAVIDs-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 11 Nov 2017 16:04:04 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2396'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_rw3cazKfFeu8g5
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_1BN0r3ACRY9yqAzK4VaA68Bg",
          "object": "event",
          "api_version": "2017-08-15",
          "created": 1510413909,
          "data": {
            "object": {
              "id": "ch_1BN0r2ACRY9yqAzKWfDLjl49",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application": null,
              "application_fee": null,
              "balance_transaction": "txn_1BN0r2ACRY9yqAzKrUzrDTGT",
              "captured": true,
              "created": 1510413908,
              "currency": "usd",
              "customer": "cus_BkVs0IRprV5gMh",
              "description": null,
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": "in_1BN0r2ACRY9yqAzK7pKdZa6Y",
              "livemode": false,
              "metadata": {},
              "on_behalf_of": null,
              "order": null,
              "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "seller_message": "Payment complete.",
                "type": "authorized"
              },
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_1BN0r2ACRY9yqAzKWfDLjl49/refunds"
              },
              "review": null,
              "shipping": null,
              "source": {
                "id": "card_1BN0r1ACRY9yqAzKmYIfzjUR",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "42424",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_BkVs0IRprV5gMh",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 4,
                "exp_year": 2024,
                "fingerprint": "q2TyZusZTFXy5XkY",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": null,
              "status": "succeeded",
              "transfer_group": null
            }
          },
          "livemode": false,
          "pending_webhooks": 0,
          "request": {
            "id": "req_NWibsb0n1zHzmU",
            "idempotency_key": null
          },
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Sat, 11 Nov 2017 16:04:04 GMT
recorded_with: VCR 3.0.1
